Repository: XuWeinan123/EncryptNotes_for_TRAE
Catalog: EncryptNotes/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt, zh_hans, zh_hant

source: You are using version %@. Would you like to download the new version from GitHub Releases?
de: Sie verwenden Version %@. Möchten Sie die neue Version von GitHub Releases herunterladen?
es: Estás usando la versión %@. ¿Te gustaría descargar la nueva versión desde GitHub Releases?
fr: Vous utilisez la version %@. Souhaitez-vous télécharger la nouvelle version depuis GitHub Releases ?
ja: 現在のバージョンは %@ です。GitHub Releases から新しいバージョンをダウンロードしますか？
ko: 현재 사용 중인 버전은 %@입니다. GitHub Releases에서 새 버전을 다운로드하시겠습니까?
pt: Você está usando a versão %@. Gostaria de baixar a nova versão do GitHub Releases?
zh_hans: 当前版本为 %@。新版本已经发布，是否前往 GitHub Release 页面下载？
zh_hant: 您正在使用版本 %@。是否要從 GitHub Releases 下載新版本？

source: Cyan
es: Cian
ja: シアン
ko: 시안
pt: ciano
zh_hans: 青色
zh_hant: 青色

source: Link
es: Enlace
fr: Lien
ja: リンク
ko: 링크
zh_hans: 链接
zh_hant: 連結

source: NavigationStack Detail
es: Detalle de NavigationStack
fr: NavigationStack Détail
ja: NavigationStack 詳細
ko: NavigationStack 상세
pt: NavigationStack Detalhe
zh_hans: NavigationStack 详情页
zh_hant: NavigationStack 詳細

source: Offline
es: Sin conexión
fr: Hors ligne
ja: オフライン
ko: 오프라인
zh_hans: 无网络
zh_hant: 離線

source: OK
es: Aceptar
ko: 확인
zh_hans: 确定
zh_hant: 確定

source: Pink
es: Rosa
fr: rose
ja: ピンク
ko: 핑크
pt: Rosa
zh_hans: 粉色
zh_hant: 粉紅色

source: Status badges.
es: Insignias de estado.
fr: Badges de statut.
ja: ステータスバッジ
ko: 상태 배지.
pt: Distintivos de status.
zh_hans: 状态胶囊标签。
zh_hant: 狀態標籤

source: System Sheet
es: Hoja del sistema
fr: Feuille système
ja: システムシート
ko: 시스템 시트
pt: Folha do Sistema
zh_hans: 系统 Sheet
zh_hant: 系統工作表

source: Editor
fr: Éditeur
ja: エディタ
ko: 편집기
zh_hans: 编辑器
zh_hant: 編輯器

source: %@ This affects %lld encrypted notes in the current list and Trash.
zh_hans: %@ 这会影响当前列表和废纸篓中的 %lld 篇加密笔记。

source: %lld days
zh_hans: %lld 天

source: %lld encrypted notes were found. Load the original key first.
zh_hans: 发现 %lld 篇加密笔记。请先加载原密钥。

source: %lld notes
zh_hans: %lld 篇笔记

source: %lld notes in Trash
zh_hans: 废纸篓中有 %lld 篇笔记

source: %lld notes, %lld encrypted
zh_hans: %lld 篇笔记，%lld 篇已加密

source: A key reference is already configured.
zh_hans: 已经配置了密钥引用。

source: A new key cannot unlock existing encrypted notes. These notes must be deleted before continuing.
zh_hans: 新密钥无法解锁现有加密笔记。继续前必须删除这些笔记。

source: About %@
zh_hans: 关于 %@

source: After saving, Seal Note will remember this key location.
zh_hans: 保存后，Seal Note 将记住此密钥位置。

source: All Notes (%lld)…
zh_hans: 全部笔记（%lld）…

source: Apply and Keep Open
zh_hans: 应用并保持打开

source: Automatically add blank lines between paragraphs when copying for Markdown editors such as Typora.
zh_hans: 复制到 Typora 等 Markdown 编辑器时，自动在段落之间添加空行。

source: Before removing the key reference, delete these encrypted notes or decrypt them all to plain text.
zh_hans: 移除密钥引用前，请删除这些加密笔记，或将它们全部解密为明文。

source: Bold
zh_hans: 粗体

source: Choose a valid Seal Note key.
zh_hans: 请选择有效的 Seal Note 密钥。

source: Choose Another Key
zh_hans: 选择其他密钥

source: Click record, then press a new key combination. Press Esc to cancel.
zh_hans: 点击录制，然后按下新的组合键。按 Esc 取消。

source: Comment
zh_hans: 注释

source: Common Actions
zh_hans: 常用操作

source: Components
zh_hans: 组件

source: Copy as Looser Markdown Paragraphs
zh_hans: 复制为宽松的 Markdown 段落

source: Could not convert to a plain-text note: %@
zh_hans: 无法转换为明文笔记：%@

source: Could not convert to an encrypted note: %@
zh_hans: 无法转换为加密笔记：%@

source: Could Not Open Folder
zh_hans: 无法打开文件夹

source: Could not open the log folder: %@
zh_hans: 无法打开日志文件夹：%@

source: Could not restore all default settings: %@
zh_hans: 无法恢复所有默认设置：%@

source: Could not update the login item setting: %@
zh_hans: 无法更新登录项设置：%@

source: Create
zh_hans: 创建

source: Create a New Key?
zh_hans: 创建新密钥？

source: Create or load a key in Key Settings first.
zh_hans: 请先在密钥设置中创建或加载密钥。

source: Creating a New Key Affects Existing Encrypted Notes
zh_hans: 创建新密钥会影响现有加密笔记

source: Creation Failed
zh_hans: 创建失败

source: Cut
zh_hans: 剪切

source: Decrypt All to Plain Text
zh_hans: 全部解密为明文

source: Delete All Encrypted Notes
zh_hans: 删除所有加密笔记

source: Delete These Notes and Create a New Key
zh_hans: 删除这些笔记并创建新密钥

source: Delete These Notes and Use This Key
zh_hans: 删除这些笔记并使用此密钥

source: Discard Empty Notes When Closing
zh_hans: 关闭时丢弃空白笔记

source: Editing Behavior
zh_hans: 编辑行为

source: Editing Experience
zh_hans: 编辑体验

source: Editor Font Size
zh_hans: 编辑器字号

source: Encrypt New Notes Automatically
zh_hans: 自动加密新笔记

source: Encrypted notes still exist. Handle them in Key Settings first.
zh_hans: 仍有加密笔记，请先在密钥设置中处理。

source: Exclude Hex Colors from Tags
zh_hans: 从标签中排除十六进制颜色

source: Finder could not open: %@
zh_hans: 访达无法打开：%@

source: Format
zh_hans: 格式

source: Go to Key Settings first.
zh_hans: 请先前往密钥设置。

source: Go to Key Settings to resolve this issue.
zh_hans: 请前往密钥设置解决此问题。

source: Hide %@
zh_hans: 隐藏 %@

source: Hide Others
zh_hans: 隐藏其他应用

source: How Should Encrypted Notes Be Handled?
zh_hans: 如何处理加密笔记？

source: iCloud Folder
zh_hans: iCloud 文件夹

source: iCloud is unavailable, so local storage is being used.
zh_hans: iCloud 不可用，当前正在使用本地存储。

source: Ignore #RRGGBB and #RRGGBBAA color values.
zh_hans: 忽略 #RRGGBB 和 #RRGGBBAA 颜色值。

source: Inline Code
zh_hans: 行内代码

source: Inline Math
zh_hans: 行内公式

source: Italic
zh_hans: 斜体

source: Keep the key safe. Encrypted notes cannot be recovered if it is lost.
zh_hans: 请妥善保管密钥。密钥丢失后无法恢复加密笔记。

source: Key Downloading
zh_hans: 正在下载密钥

source: Key Invalid
zh_hans: 密钥无效

source: Key Loaded
zh_hans: 已加载密钥

source: Key Replaced
zh_hans: 密钥已被替换

source: Key Status
zh_hans: 密钥状态

source: Language
zh_hans: 语言

source: Launch Menu Bar App at Login
zh_hans: 登录时启动菜单栏应用

source: Line Height
zh_hans: 行高

source: Load the key to view encrypted note content
zh_hans: 加载密钥以查看加密笔记内容

source: Loading Notes…
zh_hans: 正在加载笔记…

source: Local Folder
zh_hans: 本地文件夹

source: Maintenance Log
zh_hans: 维护日志

source: Markdown Formatting
zh_hans: Markdown 格式化

source: Menu Bar
zh_hans: 菜单栏

source: Name Notes Automatically
zh_hans: 自动命名笔记

source: New Note
zh_hans: 新建笔记

source: No key is currently loaded. Seal Note reads key files only on this Mac and does not save them to Keychain.
zh_hans: 当前未加载密钥。Seal Note 仅在这台 Mac 上读取密钥文件，不会将其存入钥匙串。

source: No Key Loaded
zh_hans: 未加载密钥

source: No Notes
zh_hans: 暂无笔记

source: No storage folder is currently available.
zh_hans: 当前没有可用的存储文件夹。

source: Not Set
zh_hans: 未设置

source: Note
zh_hans: 笔记

source: Note files are stored directly in a public iCloud Drive folder.
zh_hans: 笔记文件直接存储在公开的 iCloud Drive 文件夹中。

source: Paste
zh_hans: 粘贴

source: Pin New Notes by Default
zh_hans: 默认置顶新笔记

source: Quit
zh_hans: 退出

source: Record save and index metadata without recording note content or keys.
zh_hans: 记录保存与索引元数据，不记录笔记内容或密钥。

source: Recording: press a new key combination, or press Esc to cancel.
zh_hans: 正在录制：请按下新的组合键，或按 Esc 取消。

source: Redo
zh_hans: 重做

source: Relocate the key before encrypted notes can be unlocked
zh_hans: 重新定位密钥后才能解锁加密笔记

source: Remove Key Reference
zh_hans: 移除密钥引用

# key.removeReference.confirmationTitle
source: Remove Key Reference?
zh_hans: 移除密钥引用？

source: Remove the Invalid Key Reference?
zh_hans: 移除无效的密钥引用？

source: Rename failed: %@
zh_hans: 重命名失败：%@

source: Rename Note
zh_hans: 重命名笔记

source: Restore All Default Settings?
zh_hans: 恢复所有默认设置？

source: Restore All Defaults
zh_hans: 恢复所有默认设置

source: Save
zh_hans: 保存

source: Save Key
zh_hans: 保存密钥

source: Save the key in a secure location. Losing it makes encrypted notes impossible to decrypt.
zh_hans: 请将密钥保存在安全位置。密钥丢失后将无法解密笔记。

source: Seal Note reads the key file only on this Mac and never uploads it.
zh_hans: Seal Note 仅在这台 Mac 上读取密钥文件，绝不会上传。

source: Seal Note will forget the key location without deleting the key itself.
zh_hans: Seal Note 将忘记密钥位置，但不会删除密钥文件本身。

source: Select All
zh_hans: 全选

source: Settings…
zh_hans: 设置…

source: Show All
zh_hans: 全部显示

source: Something Went Wrong
zh_hans: 出现问题

source: Storage
zh_hans: 存储

source: Strikethrough
zh_hans: 删除线

source: The current key is unavailable, so encrypted notes cannot be decrypted now. If you still have the original key, cancel and relocate it first.
zh_hans: 当前密钥不可用，因此暂时无法解密笔记。如果仍保留原密钥，请取消并先重新定位它。

source: The key could not be found. Go to Key Settings to resolve this issue.
zh_hans: 找不到密钥。请前往密钥设置解决此问题。

source: The key could not be read. Go to Key Settings to resolve this issue.
zh_hans: 无法读取密钥。请前往密钥设置解决此问题。

source: The key does not match this encrypted note. Go to Key Settings to resolve this issue.
zh_hans: 密钥与此加密笔记不匹配。请前往密钥设置解决此问题。

source: The key file has been requested from iCloud. Open encrypted notes after the download finishes.
zh_hans: 已向 iCloud 请求密钥文件。下载完成后再打开加密笔记。

source: The key file is still downloading from iCloud. Try again later.
zh_hans: 密钥文件仍在从 iCloud 下载，请稍后重试。

source: The key format is invalid. Go to Key Settings to resolve this issue.
zh_hans: 密钥格式无效。请前往密钥设置解决此问题。

source: The key is invalid. %lld encrypted notes require the original key.
zh_hans: 密钥无效。%lld 篇加密笔记需要原密钥。

source: The key is no longer at its original location. Go to Key Settings to resolve this issue.
zh_hans: 密钥已不在原位置。请前往密钥设置解决此问题。

source: The key is still downloading from iCloud. Try again when the download finishes.
zh_hans: 密钥仍在从 iCloud 下载，请在下载完成后重试。

source: The key is unavailable, invalid, or has been replaced.
zh_hans: 密钥不可用、无效或已被替换。

source: The key was replaced or modified. Go to Key Settings to resolve this issue.
zh_hans: 密钥已被替换或修改。请前往密钥设置解决此问题。

source: The Selected Key Cannot Unlock Existing Notes
zh_hans: 所选密钥无法解锁现有笔记

source: The selected key will not be saved by default.
zh_hans: 默认不会保存所选密钥。

source: The title only affects lists, menus, and filenames. It does not change note content.
zh_hans: 标题只影响列表、菜单和文件名，不会更改笔记内容。

source: Theme
zh_hans: 主题

source: There is no key location to open.
zh_hans: 没有可打开的密钥位置。

source: This Mac can unlock encrypted notes
zh_hans: 这台 Mac 可以解锁加密笔记

source: This restores all settings, shortcuts, and the launch introduction without deleting notes or keys.
zh_hans: 这会恢复所有设置、快捷键和启动介绍，但不会删除笔记或密钥。

source: This setting could not be saved.
zh_hans: 无法保存此设置。

source: Toggle Markdown Preview
zh_hans: 切换 Markdown 预览

source: Trash (%lld)…
zh_hans: 废纸篓（%lld）…

source: Underline
zh_hans: 下划线

source: Undo
zh_hans: 撤销

source: When enabled, every autosave renames the note from its content. When disabled, manual titles and the initial title rule are preserved.
zh_hans: 开启后，每次自动保存都会根据内容重命名笔记；关闭后，将保留手动标题和初始标题规则。
